package com.example.administrator.dataecs.model;

import java.util.List;

public class AgreementModel {


    /**
     * msg : success
     * code : 0
     * agreementList : [{"id":1,"roleId":1,"agreementTitle":"借款协议","agreementContent":"<p>一、您同意并授权XXXX网络科技（或其委托或合作的第三方）在您注册XX平台、申请借款、审批及贷后管理期间，XXXX网络科技利用计算机及其它方式搜集、保存、处理您的个人资料【包括但不限于姓名、出生年月日、身份证号码、电话、职业及通信地址等信息您理解并同意，为更好地为您提供服务，您在使用XXXX网络科技提供的服务时，XXXX网络科技有权调取并保存您的手机位置信息、通讯录、通话记录以及短信（包括但不限于短信内容、短信时间、发送对象等）以及设备终端其他信息】和其它信息（包括但不限于个人信用、投资及保险、本人在个人贷款、各类信用卡和对外担保等信用活动中形成的交易记录等个人信贷交易信息及个人结算账户、个人住房公积金、个人养老保险金（缴存）、个人生活缴费等信息），授权XXXX网络科技及其关联公司向征信机构或其他第三方（包括但不限于学信网、中国人民银行征信中心、前海征信、同盾科技、阿里芝麻信用、中国电信、中国联通、中国移动等第三方机构或公司）核实其您的资信情况；同意并授权上述机构或公司可将其拥有的本人信息通过XXXX网络科技或XXXX网络科技合作的查询服务提供机构提供给XXXX网络科技（或者其委托合作的第三方），包括包括但不限于身份信息、联系方式（包括运营商可将手机号码状态信息、手机号码与姓名一致性信息、个人通信与上网行为、缴费行为及位置信息等相关内容信息进行加工、整理、以验证结果或信用报告方式提供给XXXX网络科技）工作信息、银行卡交易信息、银行贷款相关信息、网络交易信息、逾期信息及其他信息等，，以了解您资信状况，且XXXX网络科技有权存储上述信息。您已经充分理解并知晓该等信息被提供和使用的风险，包括但不限于：上述信息对您的信用评价、以及分析报告等结果产生不利影响的风险；该等信息被查询服务提供机构依法提供给XXXX网络科技（或其委托或合作的第三方）后可能被第三方不当利用的风险；以及基于您的特定信用状况可能被不良信息骚扰的风险等。。<\/p><p>二、您同意并授权查询服务提供机构及其关联公司及指定的第三方可留存、整理及加工本次获取的您信息用于查询服务提供机构及其关联公司及其指定的第三方为您提供的其他服务中。<\/p><p>三、您同意并授权，查询服务提供机构可将其合法获取的您的信息经过整合、加工并转化为信息评分或信息报告回传给XXXX网络科技（或其委托或合作的第三方），用于您申请借款、审批及贷后管理等事项。<\/p><p>四、您同意并授权XXXX网络科技（或其委托或合作的第三方）通过查询服务提供机构向包括但不限于中国人民银行征信中心及其分支机构以及其他信息服务机构上传您在借款过程生成的资信信息。同时，您同意并授权包括但不限于中国人民银行征信中心及其分支机构以及其他信息服务机构接收、留存XXXX网络科技（或其委托或合作的第三方）通过查询服务提供机构上传的您在借款过程生成的资信信息。您违反与XXXX网络科技或XXXX网络科技合作的其他机构签订的协议时，XXXX网络科技及其合作机构可以披露您的个人资料及违约事实，将您的违约信息写入黑名单并与必要的第三方共享数据，以供XXXX网络科技及第三方审核、追索之用。<\/p><p>五、您同意并授权XXXX网络科技对您的信息进行分析整合，并提供给向为您提供借款服务或其他服务的第三方，提供为完成该项服务所必要的信息；同意并授权为您提供借款服务或其他服务的机构向XXXX网络科技反馈对您的贷款审批、贷款发放直至该笔贷款结清为止的所有信息。<\/p><p>六、为更好地为您提供服务，您同意并授权XXXX网络科技、查询服务机构可与其合作的第三方进行联合研究，并可将通过本授权书获得的您的信息投入到该等联合研究中。但查询服务机构与其合作的第三方在开展上述联合研究前，应要求其合作的第三方对在联合研究中所获取的您的信息予以保密。<\/p><p>七、同意并授权XXXX网络科技可以将您资料用于改进XX平台或网站的设计和推广使用，包括但不限于可以将您在XXXX网络科技填写的手机号及其他信息用于与XXXX网络科技有合作的第三方机构进行账户联合注册使用。<\/p><p>八、本授权书可在您接受XXXX网络科技（或其委托或合作的第三方）提供服务（包括贷前审核和贷后管理）的过程中多次使用，XXXX网络科技（或其委托或合作的第三方）及查询服务提供机构自您签署本授权之日起可多次依据本授权书而操作执行本授权书项下的活动无需您另行授权。<\/p><p>九、您确认已充分被告知、了解并接受上述授权的法律后果。<\/p>"},{"id":2,"roleId":1,"agreementTitle":"用户协议","agreementContent":"<p>\t在此特别提醒您(用户)在注册成为用户之前，请认真阅读本《用户协议》 (以下简称\u201c协议\u201d)， 确保您充分理解本协议中各条款。请您审慎阅读并选择接受或不接受本协议。除非您接受本协议所有条款，否则您无权注册、登录或使用本协议所涉服务。您的注册、登录、使用等行为将视为对本协议的接受，并同意接受本协议各项条款的约束。本协议约定本app与用户之间关于\u201c本app\"软件服务(以下简称\u201c服务\u201d)的权利义务。\u201c用户\u201d是指注册、登录、使用本服务的个人。本协议可由本app随时更新，更新后的协议条款一旦公布即代替原来的协议条款，恕不再另行通知，用户可在本APP中查阅最新版协议条款。在修改协议条款后，如果用户不接受修改后的条款，请立即停止使用本app提供的服务，用户继续使用本app提供的服务将被视为接受修改后的协议。<\/p><p><br><\/p><h3>一、账号注册<\/h3><p>\t1、用户在使用本服务前需要注册一个\u201c本app\u201d账号。\u201c本app\u201d账号应当使用手机号码绑定注册，请用户使用尚未与\u201c本app\"账号绑定的手机号码，以及未被本app根据本协议封禁的手机号码注册\u201c本app'账号。本app可以根据用户需求或产品需要对账号注册和绑定的方式进行变更，而无须事先通知用户。<\/p><p>\t2、\u201c本app\u201d系基于同城服务的APP产品，用户注册时应当授权本app公开及使用其个人信息方可成功注册\u201c本app\u201d账号。故用户完成注册即表明用户同意本app提取、公开及使用用户的信息。<\/p><p>\t3、鉴于\u201c本app\u201d账号的绑定注册方式，您同意本app在注册时将允许您的手机号码及手机设备识别码等信息用于注册。<\/p><p>\t4、在用户注册及使用本服务时，本app需要搜集能识别用户身份的个人信息以便本app可以在必要时联系用户，或为用户提供更好的使用体验。本app搜集的信息包括但不限于用户的姓名、地址;本app同意对这些信息的使用将受限于第三条用户个人隐私信息保护的约束。<\/p><p><br><\/p><h3>二、用户个人隐私信息保护<\/h3><p>\t1、如果本app发现或收到他人举报或投诉用户违反本协议约定的，本app有 权不经通知随时对相关内容, 包括但不限于用户资料、发贴记录进行审查、删除，并视情节轻重对违规账号处以包括但不限于警告、账号封禁、设备封禁、功能封禁的处罚，且通知用户处理结果。<\/p><p>\t2、因违反用户协议被封禁的用户， 可以自行与本app联系。其中，被实施功能封禁的用户会在封禁期届满后自动恢复被封禁功能。被封禁用户可提交申诉，本app将对 申诉进行审查，并自行合理判断决定是否变更处罚措施。<\/p><p>\t3、用户理解并同意，本app有 权依合理判断对违反有关法律法规或本协议规定的行为进行处罚，对违法违规的任何用户采取适当的法律行动，并依据法律法规保存有关信息向有关部门报告等，用户应承担由此而产生的一切法律责任。<\/p><p>\t4、用户理解并同意，因用户违反本协议约定，导致或产生的任何第三方主张的任何索赔、要求或损失，包括合理的律师费，用户应当赔偿本app与合作公司、关联公司，并使之免受损害。<\/p><p><br><\/p><h3>三、用户发布内容规范<\/h3><p>\t1、本条所述内容是指用户使用本app的过程中所制作、上载、复制、发布、传播的任何内容， 包括但不限于账号头像、名称、用户说明等注册信息及认证资料，或文字、语音、图片、视频、图文等发送、回复或自动回复消息和相关链接页面，以及其他使用账号或本服务所产生的内容。<\/p><p>\t2、 用户不得利用\u201c本app\u201d账号或本服务制作、上载、复制、发布、传播如下法律、法规和政策禁止的内容:<\/p><p>\t(1)反对宪法所确定的基本原则的;<\/p><p>\t(2)危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的;<\/p><p>\t(3)损害国家荣誉和利益的;<\/p><p>\t(4)煽动民族仇恨、民族歧视， 破坏民族团结的;<\/p><p>\t(5)破坏国家宗教政策，宣扬邪教和封建迷信的;<\/p><p>\t(6)散布谣言，扰乱社会秩序， 破坏社会稳定的;<\/p><p>\t(7)散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的;<\/p><p>\t(8)侮辱或者诽谤他人，侵害他人合法权益的;<\/p><p>\t(9)含有法律、行政法规禁止的其他内容的信息。<\/p><p>\t3、用户不得利用\u201c本app'账号或本服务制作、上载、复制、发布、传播如下干扰\u201c本app\u201d正常运营，以及侵犯其他用户或第三方合法权益的内容:<\/p><p>\t(1)含有任何性或性暗示的;<\/p><p>\t(2)含有辱骂、恐吓、威胁内容的;<\/p><p>\t(3)含有骚扰、垃圾广告、恶意信息、诱骗信息的;<\/p><p>\t(4)涉及他人隐私、个人信息或资料的;<\/p><p>\t(5)侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的;<\/p><p>\t(6)含有其他干扰本服务正常运营和侵犯其他用户或第三方合法权益内容的信息。<\/p><p><br><\/p><h3>四、使用规则<\/h3><p>\t1、用户在本服务中或通过本服务所传送、发布的任何内容并不反映或代表，也不得被视为反映或代表本app的观点、立场或政策，本app对此不承担任何责任。<\/p><p>\t2、用户不得利用\u201c本app\u201d账号或本服务进行如下行为:<\/p><p>\t(1)提交、发布虚假信息， 或盗用他人头像或资料，冒充、利用他人名义的;<\/p><p>\t(2)强制、诱导其他用户关注、点击链接页面或分享信息的;<\/p><p>\t(3)虚构事实、隐瞒真相以误导、欺骗他人的;<\/p><p>\t(4)利用技术手段批量建立虚假账号的;<\/p><p>\t(5)利用\u201c本app\"账号或本服务从事任何违法犯罪活动的;<\/p><p>\t(6)制作、发布与以上行为相关的方法、工具，或对此类方法、工具进行运营或传播，无论这些行为是否为商业目的;<\/p><p>\t(7)其他违反法律法规规定、侵犯其他用户合法权益、干扰\u201c本app\u201d正常运营或本app未明示授权的行为。<\/p><p>\t3、用户须对利用\u201c本app\u201d账号或本服务传送信息的真实性、合法性、无害性、准确性、有效性等全权负责，与用户所传播的信息相关的任何法律责任由用户自行承担，与本app无关。如因此给本app或第三方造成损害的，用户应当依法予以赔偿。<\/p><p>\t4、本app提供的服务中可能包括广告，用户同意在使用过程中显示本app和第三方供应商、合作伙伴提供的广告。除法律法规明确规定外，用户应自行对依该广告信息进行的交易负责，对用户因依该广告信息进行的交易或前述广告商提供的内容而遭受的损失或损害，本app不承担任何责任。<\/p><p><br><\/p><h3>五、其他<\/h3><p>\t1、本app郑重提醒用户注意本协议中免除本app责任和限制用户权利的条款，请用户仔细阅读，自主考虑风险。未成年人应在法定监护人的陪同下阅读本协议。<\/p><p>\t2、本协议的效力、解释及纠纷的解决，适用于中华人民共和国法律。若用户和本app之间发生任何纠纷或争议，首先应友好协商解决，协商不成的，用户同意将纠纷或争议提交本app住所地有管辖权的人民法院管辖。<\/p><p>\t3、本协议的任何条款无论因何种原因无效或不具可执行性，其余条款仍有效，对双方具有约束力。<\/p><p>\t4、本协议最终解释权归本app所有，据苹果公司免责条款特此声明:该应用注册及隐私协议与苹果公司无关。<\/p>"}]
     */

    private String msg;
    private int code;
    private List<AgreementListBean> agreementList;

    public String getMsg() {
        return msg;
    }

    public void setMsg(String msg) {
        this.msg = msg;
    }

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public List<AgreementListBean> getAgreementList() {
        return agreementList;
    }

    public void setAgreementList(List<AgreementListBean> agreementList) {
        this.agreementList = agreementList;
    }

    public static class AgreementListBean {
        /**
         * id : 1
         * roleId : 1
         * agreementTitle : 借款协议
         * agreementContent : <p>一、您同意并授权XXXX网络科技（或其委托或合作的第三方）在您注册XX平台、申请借款、审批及贷后管理期间，XXXX网络科技利用计算机及其它方式搜集、保存、处理您的个人资料【包括但不限于姓名、出生年月日、身份证号码、电话、职业及通信地址等信息您理解并同意，为更好地为您提供服务，您在使用XXXX网络科技提供的服务时，XXXX网络科技有权调取并保存您的手机位置信息、通讯录、通话记录以及短信（包括但不限于短信内容、短信时间、发送对象等）以及设备终端其他信息】和其它信息（包括但不限于个人信用、投资及保险、本人在个人贷款、各类信用卡和对外担保等信用活动中形成的交易记录等个人信贷交易信息及个人结算账户、个人住房公积金、个人养老保险金（缴存）、个人生活缴费等信息），授权XXXX网络科技及其关联公司向征信机构或其他第三方（包括但不限于学信网、中国人民银行征信中心、前海征信、同盾科技、阿里芝麻信用、中国电信、中国联通、中国移动等第三方机构或公司）核实其您的资信情况；同意并授权上述机构或公司可将其拥有的本人信息通过XXXX网络科技或XXXX网络科技合作的查询服务提供机构提供给XXXX网络科技（或者其委托合作的第三方），包括包括但不限于身份信息、联系方式（包括运营商可将手机号码状态信息、手机号码与姓名一致性信息、个人通信与上网行为、缴费行为及位置信息等相关内容信息进行加工、整理、以验证结果或信用报告方式提供给XXXX网络科技）工作信息、银行卡交易信息、银行贷款相关信息、网络交易信息、逾期信息及其他信息等，，以了解您资信状况，且XXXX网络科技有权存储上述信息。您已经充分理解并知晓该等信息被提供和使用的风险，包括但不限于：上述信息对您的信用评价、以及分析报告等结果产生不利影响的风险；该等信息被查询服务提供机构依法提供给XXXX网络科技（或其委托或合作的第三方）后可能被第三方不当利用的风险；以及基于您的特定信用状况可能被不良信息骚扰的风险等。。</p><p>二、您同意并授权查询服务提供机构及其关联公司及指定的第三方可留存、整理及加工本次获取的您信息用于查询服务提供机构及其关联公司及其指定的第三方为您提供的其他服务中。</p><p>三、您同意并授权，查询服务提供机构可将其合法获取的您的信息经过整合、加工并转化为信息评分或信息报告回传给XXXX网络科技（或其委托或合作的第三方），用于您申请借款、审批及贷后管理等事项。</p><p>四、您同意并授权XXXX网络科技（或其委托或合作的第三方）通过查询服务提供机构向包括但不限于中国人民银行征信中心及其分支机构以及其他信息服务机构上传您在借款过程生成的资信信息。同时，您同意并授权包括但不限于中国人民银行征信中心及其分支机构以及其他信息服务机构接收、留存XXXX网络科技（或其委托或合作的第三方）通过查询服务提供机构上传的您在借款过程生成的资信信息。您违反与XXXX网络科技或XXXX网络科技合作的其他机构签订的协议时，XXXX网络科技及其合作机构可以披露您的个人资料及违约事实，将您的违约信息写入黑名单并与必要的第三方共享数据，以供XXXX网络科技及第三方审核、追索之用。</p><p>五、您同意并授权XXXX网络科技对您的信息进行分析整合，并提供给向为您提供借款服务或其他服务的第三方，提供为完成该项服务所必要的信息；同意并授权为您提供借款服务或其他服务的机构向XXXX网络科技反馈对您的贷款审批、贷款发放直至该笔贷款结清为止的所有信息。</p><p>六、为更好地为您提供服务，您同意并授权XXXX网络科技、查询服务机构可与其合作的第三方进行联合研究，并可将通过本授权书获得的您的信息投入到该等联合研究中。但查询服务机构与其合作的第三方在开展上述联合研究前，应要求其合作的第三方对在联合研究中所获取的您的信息予以保密。</p><p>七、同意并授权XXXX网络科技可以将您资料用于改进XX平台或网站的设计和推广使用，包括但不限于可以将您在XXXX网络科技填写的手机号及其他信息用于与XXXX网络科技有合作的第三方机构进行账户联合注册使用。</p><p>八、本授权书可在您接受XXXX网络科技（或其委托或合作的第三方）提供服务（包括贷前审核和贷后管理）的过程中多次使用，XXXX网络科技（或其委托或合作的第三方）及查询服务提供机构自您签署本授权之日起可多次依据本授权书而操作执行本授权书项下的活动无需您另行授权。</p><p>九、您确认已充分被告知、了解并接受上述授权的法律后果。</p>
         */

        private int id;
        private int roleId;
        private String agreementTitle;
        private String agreementContent;

        public int getId() {
            return id;
        }

        public void setId(int id) {
            this.id = id;
        }

        public int getRoleId() {
            return roleId;
        }

        public void setRoleId(int roleId) {
            this.roleId = roleId;
        }

        public String getAgreementTitle() {
            return agreementTitle;
        }

        public void setAgreementTitle(String agreementTitle) {
            this.agreementTitle = agreementTitle;
        }

        public String getAgreementContent() {
            return agreementContent;
        }

        public void setAgreementContent(String agreementContent) {
            this.agreementContent = agreementContent;
        }
    }
}
